{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "cancel_trip",
    "1": "cancellation_policy",
    "2": "carry_on_luggage_faq",
    "3": "change_flight",
    "4": "check_in_luggage_faq",
    "5": "complaints",
    "6": "damaged_bag",
    "7": "discounts",
    "8": "fare_check",
    "9": "flight_status",
    "10": "flights_info",
    "11": "insurance",
    "12": "medical_policy",
    "13": "missing_bag",
    "14": "pet_travel",
    "15": "prohibited_items_faq",
    "16": "seat_availability",
    "17": "sports_music_gear"
  },
  "initializer_range": 0.02,
  "label2id": {
    "cancel_trip": 0,
    "cancellation_policy": 1,
    "carry_on_luggage_faq": 2,
    "change_flight": 3,
    "check_in_luggage_faq": 4,
    "complaints": 5,
    "damaged_bag": 6,
    "discounts": 7,
    "fare_check": 8,
    "flight_status": 9,
    "flights_info": 10,
    "insurance": 11,
    "medical_policy": 12,
    "missing_bag": 13,
    "pet_travel": 14,
    "prohibited_items_faq": 15,
    "seat_availability": 16,
    "sports_music_gear": 17
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
